// Задача №1
// Prompt и confirm
// Спитати у користувача ім’я, пошту,  телефон

// 1.1
// Prompt и confirm
// Спитати у користувача імя та прізвище, адресу доставки, телефон

// 1.2
// Prompt и confirm
// Спитати у користувача автор книжки, назва, який формат електронний чи друкований

// 1.3
// Prompt и confirm
// Спитати у користувача імя та прізвище, навчальний заклад де навчається

// 1.4
// Prompt и confirm
// Спитати у користувача імя та прізвище, ким працює, де працює

// 1.5
// Prompt и confirm
// Спитати у користувача імя та прізвище, адресу проживання, телефон

/////////////////////////////////////////////////////////////////////////

// Задача №2
// Визначення типу значення, оператор typeof

// const productName = 'Mango';
// const pricePerItem = 150;
// const isOnSale = false;

// 2.1
// Визначення типу значення, оператор typeof

// const productName = 'Ice cream';
// const pricePerItem = 70;
// const isOnSale = false;

// 2.2
// Визначення типу значення, оператор typeof

// const productName = 'Phone';
// const pricePerItem = 15 000;
// const isOnSale = true;

// 2.3
// Визначення типу значення, оператор typeof

// const productName = 'Bike';
// const pricePerItem = 10 000;
// const isOnSale = false;

// 2.4
// Визначення типу значення, оператор typeof

// const productName = 'Headphone';
// const pricePerItem = 1 000;
// const isOnSale = false;

// 2.5
// Визначення типу значення, оператор typeof

// const productName = 'Pizza';
// const pricePerItem = 300;
// const isOnSale = true;

//////////////////////////////////////////////////////////////

// Задача №3

// Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання цни за штуку.
// При оголошені присвой змінним наступні характеристики товара:

// назва - строка "Droid"
// ціна за штуку - число 2000

// і вивести дані в консоль

// 3.1
// Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання цни за штуку.
// При оголошені присвой змінним наступні характеристики товара:

// назва - строка "Ice cream"
// ціна за штуку - число 70

// і вивести дані в консоль

// 3.2
// Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання цни за штуку.
// При оголошені присвой змінним наступні характеристики товара:

// назва - строка "Phone"
// ціна за штуку - число 15 000

// і вивести дані в консоль

// 3.3
// Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання цни за штуку.
// При оголошені присвой змінним наступні характеристики товара:

// назва - строка "Headphone"
// ціна за штуку - число 1 000

// і вивести дані в консоль


// 3.4
// Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання цни за штуку.
// При оголошені присвой змінним наступні характеристики товара:

// назва - строка "Pizza"
// ціна за штуку - число 300

// і вивести дані в консоль


// 3.5
// Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання цни за штуку.
// При оголошені присвой змінним наступні характеристики товара:

// назва - строка "T-shirt"
// ціна за штуку - число 1 200

// і вивести дані в консоль

////////////////////////////////////////////////////////////////


// Задача №4
// Ім'я товару змінили на "Repair droid" і збільшили його ціну на 1500 кредитів.
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "Droid";
// let pricePerItem = 2000;

// 4.1
// Ім'я товару змінили на "Ice cream cones" і збільшили його ціну на 150 кредитів.
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "Ice cream";
// let pricePerItem = 70;

// 4.2
// Ім'я товару змінили на "Motorola" і збільшили його ціну на 2500 кредитів.
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "Phone";
// let pricePerItem = 15 000;

// 4.3
// Ім'я товару змінили на "AirProds" і збільшили його ціну на 500 кредитів.
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "Headphone";
// let pricePerItem = 1 000;

// 4.4
// Ім'я товару змінили на "Hot Dog" і зменшили його ціну на 50 кредитів.
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "Pizza";
// let pricePerItem = 300;

// 4.5
// Ім'я товару змінили на "Sweater" і збільшили його ціну на 500 кредитів.
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "T-shirt";
// let pricePerItem = 1 200;

///////////////////////////////////////////////////////////////////////////


// Задача №5
// Оголоси наступні змінні, використовуючи ключове слово const або let, 
// і присвой їм відповідні значення.
// Виведи дані в консоль.

// topSpeed - число 160.
// distance - число 617.54.
// login - рядок "mango935".
// isOnline - буль true.
// isAdmin - буль false.



